#Задача№1
# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

#     *Пример:*

#     - [2, 3, 4, 5, 6] => [12, 15, 16];
#     - [2, 3, 5, 6] => [12, 15]

lst = [2, 3, 4, 5, 6, 7]
pr = 1
z = int(len(lst)/2)
if int(len(lst)) % 2 == 0:
    for i in range(z):
        pr = lst[i] * lst[len(lst) - i - 1]
        print(pr,end=' ')
else:
    for i in range(z + 1):
        pr = lst[i] * lst[len(lst) - i - 1]
        print(pr,end=' ')
